#Задача No1. Решение в группах
#За день машина проезжает n километров.
#Сколько дней нужно, чтобы проехать маршрут длиной m километров? 
#При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.
#Input:
#n = 700 m = 750 Output: 2


# n = 700
# m = 750

# print((m+n-1)//n)

# def quick_sort(array):
#     if len(array) <= 1:
#          return array
#     else:
#          pivot = [0]
#     less = [i for i in array[1:]if i <= pivot]
#     greater = [i for i in array[1:]if i > pivot]
             
#     return quick_sort(less) + [pivot] + quick_sort(greater)
   
# print(quick_sort([1, 2, 3, 6, 9, 2, 23, 16, 24,]))

